In [1]:
import pandas as pd
print(pd.__version__)

1.1.1

In [3]:
list=[12,24,36]
s=pd.Series(list) #pandas.Series( data, index, dtype, copy) <-- constructor of series
s

0    12
1    24
2    36
dtype: int64

In [3]:
import pandas as pd
s1=pd.Series(list,index=["pete","ram","ali"])
print(s1)

pete    <class 'list'>
ram     <class 'list'>
ali     <class 'list'>
dtype: object

In [5]:
dict1={'pete':12,'ram':24,'ali':36} #dict key are used as index 
s2=pd.Series(dict1)
print(s2)

pete    12
ram     24
ali     36
dtype: int64

In [6]:
#Retrieving data using position
print(s2[:2])

pete    12
ram     24
dtype: int64

In [ ]:
#<--- DATA FRAME --->
#pandas.DataFrame( data, index, columns, dtype, copy) <-- constructor of data frame

In [8]:
dic={'Name':['pete','ram','ali','sham'],'Age':[12,24,36,64]}
df=pd.DataFrame(dic,index=[1,2,3,4])
print(df)

   Name  Age
1  pete   12
2   ram   24
3   ali   36
4  sham   64

In [1]:
import pandas as pd

In [4]:
#column add
name = pd.Series(['Peter', 'John', 'Mathew', 'Alex', 'George'])
age = pd.Series([12,24,21,34,29])
dic2 = {'Name' : name,'Age' : age}
df3 = pd.DataFrame(dic2)
print(df3)

     Name  Age
0   Peter   12
1    John   24
2  Mathew   21
3    Alex   34
4  George   29

In [7]:
df3['Score']=pd.Series([34,5,78,45,87])
print(df3)

     Name  Age  Score
0   Peter   12     34
1    John   24      5
2  Mathew   21     78
3    Alex   34     45
4  George   29     87

In [8]:
#delete the column
del df3['Score']
df3

     Name  Age
0   Peter   12
1    John   24
2  Mathew   21
3    Alex   34
4  George   29

In [25]:
update=pd.DataFrame([['ramit',13]],index=[5],columns=['Name','Age'])
df4=pd.DataFrame(df3.append(update))
df4

     Name  Age
0   Peter   12
1    John   24
2  Mathew   21
3    Alex   34
4  George   29
5   ramit   13

In [26]:
df4.drop(5)

     Name  Age
0   Peter   12
1    John   24
2  Mathew   21
3    Alex   34
4  George   29

In [2]:
import pandas as pd
dict1={'pete':12,'ram':24,'ali':36} #dict key are used as index 
s2=pd.Series(dict1)
print(s2)

pete    12
ram     24
ali     36
dtype: int64

In [12]:
print(s2.axes)
print(s2.size)
print(s2.values)
print('\n')
print(s2.head(2)) #similarly tail from end of dataset

[Index(['pete', 'ram', 'ali'], dtype='object')]
3
[12 24 36]


pete    12
ram     24
dtype: int64

In [20]:
dic={'Name':['pete','ram','ali','sham'],'Age':[12,24,36,64]}
df3=pd.DataFrame(dic,index=[1,2,3,4])
update=pd.DataFrame([['ramit',13]],index=[5],columns=['Name','Age'])
df4=pd.DataFrame(df3.append(update))
df4

    Name  Age
1   pete   12
2    ram   24
3    ali   36
4   sham   64
5  ramit   13

In [23]:
print(df4.T) #transpose
print('\n')
print(df4.axes)
print('\n')
print(df4.ndim)

         1    2    3     4      5
Name  pete  ram  ali  sham  ramit
Age     12   24   36    64     13


[Int64Index([1, 2, 3, 4, 5], dtype='int64'), Index(['Name', 'Age'], dtype='object')]


2

In [24]:
    name = pd.Series(['Peter','John','Mathew','Hasan','Alex','Amir'])
    age = pd.Series([12,23,16,21,34,24])
    score = pd.Series([67,87,56,90,60,85])

    df2 = pd.DataFrame({'Name':name, 'Age': age, 'Score':score})
    df2

     Name  Age  Score
0   Peter   12     67
1    John   23     87
2  Mathew   16     56
3   Hasan   21     90
4    Alex   34     60
5    Amir   24     85